Keeping track of time spent on different projects.

`C-c C-x C-i' for starting a clock.
`C-c C-x C-o' for stopping the clock.
`C-c C-x C-d' for showing times.
`C-c C-x C-q' for canceling a timer.
`C-c C-y' for updating time on line.

'follow' = read email, irc, tickets, blog posts in order to follow the
progress

* Projects
** Glasklar (glasklar)
Should be working 60% for Glasklar, which translates to 24h/w.
Glasklar work includes many small things, like keeping the office in
shape and all infrastructure working. Therefore I will add 10%
overhead, which makes clocking 22h/w being the goal.

** ADB-Centralen (adbc)

** Tor (tor)

* Time spent 2024
** v7

*** glasklar
:LOGBOOK:
CLOCK: [2024-02-15 Thu 13:00]
CLOCK: [2024-02-15 Thu 08:12]--[2024-02-15 Thu 12:00] =>  3:48
CLOCK: [2024-02-13 Tue 18:40]--[2024-02-13 Tue 19:08] =>  0:28
CLOCK: [2024-02-13 Tue 16:00]--[2024-02-13 Tue 18:08] =>  2:08
CLOCK: [2024-02-13 Tue 13:15]--[2024-02-13 Tue 15:25] =>  2:10
CLOCK: [2024-02-13 Tue 08:10]--[2024-02-13 Tue 12:22] =>  4:12
CLOCK: [2024-02-12 Mon 19:25]--[2024-02-12 Mon 20:05] =>  0:40
CLOCK: [2024-02-12 Mon 13:00]--[2024-02-12 Mon 16:30] =>  3:30
CLOCK: [2024-02-12 Mon 11:00]--[2024-02-12 Mon 11:30] =>  0:30
:END:

*** nox
wed 11:00 15:30
mon 16:30 18:00?

** v6
glasklar diff total: 31 (19 + 12)
glasklar diff this week: 12 (34 - 22)

*** glasklar
:LOGBOOK:
CLOCK: [2024-02-08 Thu 07:45]--[2024-02-08 Thu 17:27] =>  9:42
CLOCK: [2024-02-07 Wed 20:00]--[2024-02-07 Wed 20:23] =>  0:23
CLOCK: [2024-02-07 Wed 08:40]--[2024-02-07 Wed 17:30] =>  8:50
CLOCK: [2024-02-06 Tue 08:45]--[2024-02-06 Tue 17:50] =>  9:05
CLOCK: [2024-02-05 Mon 13:01]--[2024-02-05 Mon 17:17] =>  4:16
CLOCK: [2024-02-05 Mon 09:02]--[2024-02-05 Mon 10:12] =>  1:10
:END:

** v5
glasklar diff total: 19 (25 - 6)
glasklar diff this week: -6 (16 - 22)

*** glasklar
:LOGBOOK:
CLOCK: [2024-02-04 Sun 12:00]--[2024-02-04 Sun 14:00] =>  2:00
CLOCK: [2024-02-02 Fri 09:00]--[2024-02-02 Fri 10:25] =>  1:25
CLOCK: [2024-02-01 Thu 15:55]--[2024-02-01 Thu 16:35] =>  0:40
CLOCK: [2024-02-01 Thu 13:08]--[2024-02-01 Thu 15:14] =>  2:06
CLOCK: [2024-02-01 Thu 08:30]--[2024-02-01 Thu 11:51] =>  3:21
CLOCK: [2024-01-31 Wed 18:35]--[2024-01-31 Wed 19:41] =>  1:06
CLOCK: [2024-01-29 Mon 12:57]--[2024-01-29 Mon 14:17] =>  1:20
CLOCK: [2024-01-29 Mon 08:08]--[2024-01-29 Mon 11:50] =>  3:42
CLOCK: [2024-01-29 Mon 07:40]--[2024-01-29 Mon 07:50] =>  0:10
:END:

** v4
glasklar diff total: 25 (21 + 4)
glasklar diff this week: 4 (26 - 22)

*** glasklar
:LOGBOOK:
CLOCK: [2024-01-26 Fri 13:15]--[2024-01-26 Fri 14:28] =>  1:13
CLOCK: [2024-01-26 Fri 09:00]--[2024-01-26 Fri 12:30] =>  3:30
CLOCK: [2024-01-26 Fri 08:34]--[2024-01-26 Fri 08:51] =>  0:17
CLOCK: [2024-01-25 Thu 16:16]--[2024-01-25 Thu 17:41] =>  1:25
CLOCK: [2024-01-25 Thu 13:00]--[2024-01-25 Thu 15:02] =>  2:02
CLOCK: [2024-01-25 Thu 09:26]--[2024-01-25 Thu 12:30] =>  3:04
CLOCK: [2024-01-24 Wed 14:00]--[2024-01-24 Wed 19:54] =>  5:54
CLOCK: [2024-01-24 Wed 08:53]--[2024-01-24 Wed 13:00] =>  4:07
CLOCK: [2024-01-24 Wed 07:50]--[2024-01-24 Wed 08:18] =>  0:28
CLOCK: [2024-01-23 Tue 14:32]--[2024-01-23 Tue 15:00] =>  0:28
CLOCK: [2024-01-23 Tue 10:51]--[2024-01-23 Tue 11:33] =>  0:42
CLOCK: [2024-01-22 Mon 12:30]--[2024-01-22 Mon 15:13] =>  2:43
:END:

** v3
glasklar diff total: +21 (16 + 5)
glasklar diff this week: +5 (27 - 22)

*** glasklar
:LOGBOOK:
CLOCK: [2024-01-20 Sat 10:00]--[2024-01-20 Sat 10:16] =>  0:16
CLOCK: [2024-01-20 Sat 09:00]--[2024-01-20 Sat 09:52] =>  0:52
CLOCK: [2024-01-19 Fri 16:37]--[2024-01-19 Fri 17:45] =>  1:08
CLOCK: [2024-01-18 Thu 14:07]--[2024-01-18 Thu 18:00] =>  3:53
CLOCK: [2024-01-18 Thu 12:46]--[2024-01-18 Thu 13:21] =>  0:35
CLOCK: [2024-01-18 Thu 07:50]--[2024-01-18 Thu 10:28] =>  2:38
CLOCK: [2024-01-16 Tue 15:49]--[2024-01-16 Tue 19:14] =>  3:25
CLOCK: [2024-01-16 Tue 09:45]--[2024-01-16 Tue 14:02] =>  4:17
CLOCK: [2024-01-16 Tue 06:00]--[2024-01-16 Tue 06:30] =>  0:30
CLOCK: [2024-01-15 Mon 19:36]--[2024-01-15 Mon 20:20] =>  0:44
CLOCK: [2024-01-15 Mon 15:30]--[2024-01-15 Mon 17:51] =>  2:21
CLOCK: [2024-01-15 Mon 07:45]--[2024-01-15 Mon 14:03] =>  6:18
:END:
*** nox
:LOGBOOK:
CLOCK: [2024-01-17 Wed 14:00]--[2024-01-17 Wed 15:46] =>  1:46
:END:

** v2
glasklar diff total: +16 (6 + 10)
glasklar diff this week: +10 (32 - 22)

:LOGBOOK:
CLOCK: [2024-01-12 Fri 10:35]--[2024-01-12 Fri 12:24] =>  1:49
CLOCK: [2024-01-12 Fri 08:00]--[2024-01-12 Fri 09:12] =>  1:12
CLOCK: [2024-01-12 Fri 07:10]--[2024-01-12 Fri 07:28] =>  0:18
CLOCK: [2024-01-11 Thu 08:20]--[2024-01-11 Thu 16:45] =>  8:25
CLOCK: [2024-01-10 Wed 12:00]--[2024-01-10 Wed 18:00] =>  6:00
CLOCK: [2024-01-10 Wed 08:20]--[2024-01-10 Wed 10:40] =>  2:20
CLOCK: [2024-01-09 Tue 13:15]--[2024-01-09 Tue 17:02] =>  3:47
CLOCK: [2024-01-09 Tue 09:45]--[2024-01-09 Tue 12:00] =>  2:15
CLOCK: [2024-01-08 Mon 12:30]--[2024-01-08 Mon 15:00] =>  2:30
CLOCK: [2024-01-08 Mon 08:30]--[2024-01-08 Mon 11:57] =>  3:27
:END:

** v1
NOTE: 1st and 6th are public holidays so a full week is 19h (22 3* 5/)
glasklar diff total: +6 (24 - 18)
glasklar diff this week: -18 (1 - 19)
*** glasklar
:LOGBOOK:
CLOCK: [2024-01-03 Wed 09:00]--[2024-01-03 Wed 09:28] =>  0:28
:END:

* Time spent 2023
** v52
NOTE: 25:th and 26:th are public holidays so a full week is 13h (22 3* 5/)
glasklar diff total: +24 (37 - 13)
glasklar diff this week: -13 (0 - 13)

** v51
glasklar diff total: +37 (41 - 4)
glasklar diff this week: -4 (18 - 22)
*** glasklar
:LOGBOOK:
CLOCK: [2023-12-20 Wed 14:45]--[2023-12-20 Wed 17:18] =>  2:33
CLOCK: [2023-12-20 Wed 07:45]--[2023-12-20 Wed 13:00] =>  5:15
CLOCK: [2023-12-19 Tue 13:15]--[2023-12-19 Tue 16:56] =>  3:41
CLOCK: [2023-12-19 Tue 10:00]--[2023-12-19 Tue 12:03] =>  2:03
CLOCK: [2023-12-18 Mon 15:30]--[2023-12-18 Mon 16:40] =>  1:10
CLOCK: [2023-12-18 Mon 13:25]--[2023-12-18 Mon 13:39] =>  0:14
CLOCK: [2023-12-18 Mon 10:10]--[2023-12-18 Mon 12:50] =>  2:40
:END:

** v50
glasklar diff total: +41 (25 + 16)
glasklar diff this week: +16 (38 - 22)
*** glasklar
:LOGBOOK:
CLOCK: [2023-12-15 Fri 10:30]--[2023-12-15 Fri 12:51] =>  2:21
CLOCK: [2023-12-14 Thu 09:00]--[2023-12-14 Thu 17:40] =>  8:40
CLOCK: [2023-12-13 Wed 08:50]--[2023-12-13 Wed 17:30] =>  8:40
CLOCK: [2023-12-12 Tue 09:00]--[2023-12-12 Tue 17:40] =>  8:40
CLOCK: [2023-12-11 Mon 12:45]--[2023-12-11 Mon 17:00] =>  4:15
CLOCK: [2023-12-11 Mon 07:30]--[2023-12-11 Mon 12:15] =>  4:45
:END:

** v49
glasklar diff total: +25 (25 + 0)
glasklar diff this week: 0 (22 - 22)
*** glasklar
:LOGBOOK:
CLOCK: [2023-12-08 Fri 11:13]--[2023-12-08 Fri 11:25] =>  0:12
CLOCK: [2023-12-07 Thu 16:13]--[2023-12-07 Thu 17:10] =>  0:57
CLOCK: [2023-12-07 Thu 08:10]--[2023-12-07 Thu 15:00] =>  6:50
CLOCK: [2023-12-06 Wed 18:34]--[2023-12-06 Wed 18:54] =>  0:20
CLOCK: [2023-12-06 Wed 14:45]--[2023-12-06 Wed 15:29] =>  0:44
CLOCK: [2023-12-05 Tue 19:00]--[2023-12-05 Tue 19:30] =>  0:30
CLOCK: [2023-12-05 Tue 15:16]--[2023-12-05 Tue 16:31] =>  1:15
CLOCK: [2023-12-05 Tue 08:02]--[2023-12-05 Tue 14:40] =>  7:14
CLOCK: [2023-12-04 Mon 16:05]--[2023-12-04 Mon 17:31] =>  1:26
CLOCK: [2023-12-04 Mon 12:30]--[2023-12-04 Mon 14:04] =>  1:34
CLOCK: [2023-12-04 Mon 10:20]--[2023-12-04 Mon 11:08] =>  0:48
:END:
*** verkligen
:LOGBOOK:
CLOCK: [2023-12-05 Tue 19:38]--[2023-12-05 Tue 20:05] =>  0:27
:END:

** v48
glasklar diff total: +25 (17 + 12)
glasklar diff this week: +12  (34 - 22)
*** glasklar
:LOGBOOK:
CLOCK: [2023-12-01 Fri 08:00]--[2023-12-01 Fri 16:00] =>  8:00
CLOCK: [2023-11-30 Thu 07:49]--[2023-11-30 Thu 18:00] => 10:11
CLOCK: [2023-11-29 Wed 17:25]--[2023-11-29 Wed 18:08] =>  0:43
CLOCK: [2023-11-29 Wed 15:30]--[2023-11-29 Wed 16:00] =>  0:30
CLOCK: [2023-11-29 Wed 13:00]--[2023-11-29 Wed 15:00] =>  2:00
CLOCK: [2023-11-29 Wed 09:22]--[2023-11-29 Wed 12:11] =>  2:49
CLOCK: [2023-11-28 Tue 19:45]--[2023-11-28 Tue 20:29] =>  0:44
CLOCK: [2023-11-28 Tue 16:35]--[2023-11-28 Tue 16:55] =>  0:00
CLOCK: [2023-11-28 Tue 12:00]--[2023-11-28 Tue 15:59] =>  3:59
CLOCK: [2023-11-28 Tue 06:03]--[2023-11-28 Tue 06:22] =>  0:19
CLOCK: [2023-11-27 Mon 13:00]--[2023-11-27 Mon 15:15] =>  2:15
CLOCK: [2023-11-27 Mon 10:12]--[2023-11-27 Mon 12:16] =>  2:04
:END:
*** tor
:LOGBOOK:
CLOCK: [2023-11-27 Wed 19:00]--[2023-11-27 Wed 20:30] =>  1:30
:END:

** v47
*** glasklar
:LOGBOOK:
CLOCK: [2023-11-24 Fri 16:12]--[2023-11-24 Fri 17:12] =>  1:00
CLOCK: [2023-11-24 Fri 14:43]--[2023-11-24 Fri 15:05] =>  0:22
CLOCK: [2023-11-24 Fri 13:39]--[2023-11-24 Fri 14:01] =>  0:22
CLOCK: [2023-11-24 Fri 11:49]--[2023-11-24 Fri 12:49] =>  1:00
CLOCK: [2023-11-23 Thu 18:56]--[2023-11-23 Thu 20:14] =>  1:18
CLOCK: [2023-11-23 Thu 15:22]--[2023-11-23 Thu 15:37] =>  0:15
CLOCK: [2023-11-23 Thu 13:50]--[2023-11-23 Thu 14:22] =>  0:32
CLOCK: [2023-11-23 Thu 08:00]--[2023-11-23 Thu 11:20] =>  3:20
CLOCK: [2023-11-22 Wed 18:30]--[2023-11-22 Wed 19:38] =>  1:08
CLOCK: [2023-11-22 Wed 16:43]--[2023-11-22 Wed 17:32] =>  0:49
CLOCK: [2023-11-22 Wed 16:04]--[2023-11-22 Wed 16:22] =>  0:18
CLOCK: [2023-11-22 Wed 15:35]--[2023-11-22 Wed 16:00] =>  0:25
CLOCK: [2023-11-22 Wed 14:12]--[2023-11-22 Wed 15:29] =>  1:17
CLOCK: [2023-11-22 Wed 13:00]--[2023-11-22 Wed 13:32] =>  0:32
CLOCK: [2023-11-22 Wed 07:32]--[2023-11-22 Wed 12:15] =>  4:43
CLOCK: [2023-11-21 Tue 13:04]--[2023-11-21 Tue 15:05] =>  2:01
CLOCK: [2023-11-21 Tue 10:20]--[2023-11-21 Tue 12:04] =>  1:44
CLOCK: [2023-11-20 Mon 12:50]--[2023-11-20 Mon 16:14] =>  3:24
CLOCK: [2023-11-20 Mon 10:20]--[2023-11-20 Mon 12:01] =>  1:41
CLOCK: [2023-11-20 Mon 08:00]--[2023-11-20 Mon 09:30] =>  1:30
:END:
*** tor
:LOGBOOK:
CLOCK: [2023-11-22 Wed 13:32]--[2023-11-22 Wed 14:12] =>  0:40
:END:

** v46
glasklar diff total: +17 (7 + 10)
glasklar diff this week: +7  (29 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-11-13 Mon 08:25]--[2023-11-13 Mon 08:31] =>  0:06
:END:

*** glasklar
:LOGBOOK:
CLOCK: [2023-11-17 Fri 12:30]--[2023-11-17 Fri 14:10] =>  1:40
CLOCK: [2023-11-17 Fri 05:33]--[2023-11-17 Fri 06:31] =>  0:58
CLOCK: [2023-11-16 Thu 09:00]--[2023-11-16 Thu 17:00] =>  8:00
CLOCK: [2023-11-15 Wed 09:00]--[2023-11-15 Wed 17:00] =>  8:00
CLOCK: [2023-11-15 Wed 07:30]--[2023-11-15 Wed 08:32] =>  1:02
CLOCK: [2023-11-14 Tue 19:08]--[2023-11-14 Tue 19:12] =>  0:04
CLOCK: [2023-11-14 Tue 16:32]--[2023-11-14 Tue 17:06] =>  0:34
CLOCK: [2023-11-14 Tue 16:17]--[2023-11-14 Tue 16:25] =>  0:08
CLOCK: [2023-11-14 Tue 14:30]--[2023-11-14 Tue 16:10] =>  1:40
CLOCK: [2023-11-14 Tue 13:23]--[2023-11-14 Tue 13:48] =>  0:25
CLOCK: [2023-11-13 Mon 13:43]--[2023-11-13 Mon 14:30] =>  0:47
CLOCK: [2023-11-13 Mon 13:00]--[2023-11-13 Mon 13:33] =>  0:33
CLOCK: [2023-11-13 Mon 08:31]--[2023-11-13 Mon 12:36] =>  4:05
CLOCK: [2023-11-13 Mon 08:00]--[2023-11-13 Mon 08:25] =>  0:25
:END:

*** verkligen
:LOGBOOK:
CLOCK: [2023-11-13 Mon 19:54]--[2023-11-13 Mon 20:37] =>  0:43
:END:

** v45
glasklar diff total: +10 (2 + 8)
glasklar diff this week: +2 (24 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-11-10 Fri 13:40]--[2023-11-10 Fri 14:38] =>  0:58
:END:
*** glasklar
:LOGBOOK:
CLOCK: [2023-11-11 Sat 11:17]--[2023-11-11 Sat 11:27] =>  0:10
CLOCK: [2023-11-10 Fri 16:00]--[2023-11-10 Fri 16:15] =>  0:15
CLOCK: [2023-11-10 Fri 13:03]--[2023-11-10 Fri 13:39] =>  0:36
CLOCK: [2023-11-10 Fri 10:10]--[2023-11-10 Fri 11:38] =>  1:28
CLOCK: [2023-11-09 Thu 12:52]--[2023-11-09 Thu 14:58] =>  2:06
CLOCK: [2023-11-09 Thu 10:00]--[2023-11-09 Thu 11:43] =>  1:43
CLOCK: [2023-11-08 Wed 16:47]--[2023-11-08 Wed 18:53] =>  2:06
CLOCK: [2023-11-08 Wed 14:36]--[2023-11-08 Wed 15:00] =>  0:24
CLOCK: [2023-11-08 Wed 13:18]--[2023-11-08 Wed 14:03] =>  0:45
CLOCK: [2023-11-08 Wed 13:17]--[2023-11-08 Wed 13:18] =>  0:01
CLOCK: [2023-11-08 Wed 10:32]--[2023-11-08 Wed 12:25] =>  1:53
CLOCK: [2023-11-08 Wed 08:00]--[2023-11-08 Wed 09:49] =>  1:49
CLOCK: [2023-11-07 Tue 18:31]--[2023-11-07 Tue 19:13] =>  0:42
CLOCK: [2023-11-07 Tue 15:57]--[2023-11-07 Tue 16:05] =>  0:08
CLOCK: [2023-11-07 Tue 12:26]--[2023-11-07 Tue 14:57] =>  2:31
CLOCK: [2023-11-07 Tue 10:59]--[2023-11-07 Tue 12:05] =>  1:06
CLOCK: [2023-11-06 Mon 15:30]--[2023-11-06 Mon 16:10] =>  0:40
CLOCK: [2023-11-06 Mon 12:48]--[2023-11-06 Mon 15:18] =>  2:30
CLOCK: [2023-11-06 Mon 09:43]--[2023-11-06 Mon 12:02] =>  2:19
CLOCK: [2023-11-06 Mon 08:56]--[2023-11-06 Mon 09:18] =>  0:22
CLOCK: [2023-11-06 Mon 07:50]--[2023-11-06 Mon 08:29] =>  0:39
:END:
*** tor
:LOGBOOK:
CLOCK: [2023-11-06 Mon 09:23]--[2023-11-06 Mon 09:43] =>  0:20
:END:
*** verkligen
:LOGBOOK:
CLOCK: [2023-11-07 Tue 14:57]--[2023-11-07 Tue 15:57] =>  1:00
:END:

** v44
glasklar diff total: +8 (-19 + 27)
glasklar diff this week: -19 (3 - 22)

Höstlov.
3h glasklar

** v43
glasklar diff total: +43  (16 + 27)
glasklar diff this week: +16 (38 - 22)

*** glasklar
:LOGBOOK:
CLOCK: [2023-10-27 Fri 11:26]--[2023-10-27 Fri 12:00] =>  0:34
CLOCK: [2023-10-26 Thu 08:00]--[2023-10-26 Thu 18:00] => 10:00
CLOCK: [2023-10-25 Wed 08:30]--[2023-10-25 Wed 18:00] =>  9:30
CLOCK: [2023-10-24 Tue 08:00]--[2023-10-24 Tue 18:00] => 10:00
CLOCK: [2023-10-23 Mon 15:50]--[2023-10-23 Mon 17:50] =>  2:00
CLOCK: [2023-10-23 Mon 13:50]--[2023-10-23 Mon 14:35] =>  0:45
CLOCK: [2023-10-23 Mon 09:00]--[2023-10-23 Mon 13:37] =>  4:37
:END:

** v42
glasklar total: +27 (0 + 27)
glasklar this week: 0 (22 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-10-22 Sun 17:35]--[2023-10-22 Sun 18:34] =>  0:59
CLOCK: [2023-10-22 Sun 12:21]--[2023-10-22 Sun 14:57] =>  2:36
CLOCK: [2023-10-21 Sat 10:47]--[2023-10-21 Sat 11:15] =>  0:28
CLOCK: [2023-10-17 Tue 13:54]--[2023-10-17 Tue 14:00] =>  0:06
CLOCK: [2023-10-16 Mon 11:32]--[2023-10-16 Mon 12:08] =>  0:36
:END:

*** glasklar
:LOGBOOK:
CLOCK: [2023-10-20 Fri 11:39]--[2023-10-20 Fri 12:02] =>  0:23
CLOCK: [2023-10-20 Fri 10:20]--[2023-10-20 Fri 11:32] =>  1:12
CLOCK: [2023-10-20 Fri 08:35]--[2023-10-20 Fri 08:48] =>  0:13
CLOCK: [2023-10-20 Fri 08:21]--[2023-10-20 Fri 08:30] =>  0:09
CLOCK: [2023-10-19 Thu 09:24]--[2023-10-19 Thu 14:15] =>  4:51
CLOCK: [2023-10-18 Wed 13:51]--[2023-10-18 Wed 17:41] =>  3:50
CLOCK: [2023-10-18 Wed 10:00]--[2023-10-18 Wed 12:35] =>  2:35
CLOCK: [2023-10-17 Tue 20:10]--[2023-10-17 Tue 20:23] =>  0:13
CLOCK: [2023-10-17 Tue 14:00]--[2023-10-17 Tue 14:07] =>  0:07
CLOCK: [2023-10-17 Tue 13:22]--[2023-10-17 Tue 13:54] =>  0:32
CLOCK: [2023-10-17 Tue 11:50]--[2023-10-17 Tue 11:56] =>  0:06
CLOCK: [2023-10-16 Mon 13:10]--[2023-10-16 Mon 17:51] =>  4:41
CLOCK: [2023-10-16 Mon 12:08]--[2023-10-16 Mon 12:40] =>  0:32
CLOCK: [2023-10-16 Mon 08:43]--[2023-10-16 Mon 11:32] =>  2:49
:END:

*** tor
:LOGBOOK:
CLOCK: [2023-10-20 Fri 09:35]--[2023-10-20 Fri 10:20] =>  0:45
CLOCK: [2023-10-19 Thu 14:15]--[2023-10-19 Thu 14:31] =>  0:16
CLOCK: [2023-10-19 Thu 08:45]--[2023-10-19 Thu 09:24] =>  0:39
:END:

*** verkligen
:LOGBOOK:
CLOCK: [2023-10-20 Fri 11:32]--[2023-10-20 Fri 11:39] =>  0:07
CLOCK: [2023-10-20 Fri 08:48]--[2023-10-20 Fri 09:17] =>  0:29
CLOCK: [2023-10-20 Fri 07:54]--[2023-10-20 Fri 08:20] =>  0:26
CLOCK: [2023-10-19 Thu 18:20]--[2023-10-19 Thu 20:39] =>  2:19
CLOCK: [2023-10-19 Thu 14:31]--[2023-10-19 Thu 15:45] =>  1:14
CLOCK: [2023-10-18 Wed 19:40]--[2023-10-18 Wed 20:23] =>  0:43
CLOCK: [2023-10-17 Tue 19:40]--[2023-10-17 Tue 20:10] =>  0:30
:END:

** v41
glasklar total: +27 (-5 + 32)
glasklar this week: -5 (17 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-10-11 Wed 13:20]--[2023-10-11 Wed 13:26] =>  0:06
CLOCK: [2023-10-11 Wed 09:00]--[2023-10-11 Wed 13:15] =>  4:15
CLOCK: [2023-10-10 Tue 22:52]--[2023-10-11 Wed 00:19] =>  1:27
CLOCK: [2023-10-10 Tue 17:56]--[2023-10-10 Tue 19:17] =>  1:21
CLOCK: [2023-10-10 Tue 17:30]--[2023-10-10 Tue 17:50] =>  0:20
CLOCK: [2023-10-10 Tue 12:00]--[2023-10-10 Tue 14:30] =>  2:30
CLOCK: [2023-10-10 Tue 08:00]--[2023-10-10 Tue 08:25] =>  0:25
CLOCK: [2023-10-09 Mon 21:40]--[2023-10-09 Mon 22:43] =>  1:03
CLOCK: [2023-10-09 Mon 18:21]--[2023-10-09 Mon 18:26] =>  0:05
CLOCK: [2023-10-09 Mon 14:56]--[2023-10-09 Mon 15:10] =>  0:14
CLOCK: [2023-10-09 Mon 09:15]--[2023-10-09 Mon 09:32] =>  0:17
CLOCK: [2023-10-09 Mon 08:00]--[2023-10-09 Mon 08:16] =>  0:16
CLOCK: [2023-10-09 Mon 07:35]--[2023-10-09 Mon 07:50] =>  0:15
:END:

*** glasklar
:LOGBOOK:
CLOCK: [2023-10-14 Sat 15:50]--[2023-10-14 Sat 16:10] =>  0:20
CLOCK: [2023-10-12 Thu 09:15]--[2023-10-12 Thu 16:53] =>  7:38
CLOCK: [2023-10-11 Wed 14:50]--[2023-10-11 Wed 17:24] =>  2:34
CLOCK: [2023-10-11 Wed 13:27]--[2023-10-11 Wed 13:40] =>  0:13
CLOCK: [2023-10-11 Wed 13:15]--[2023-10-11 Wed 13:20] =>  0:05
CLOCK: [2023-10-10 Tue 07:43]--[2023-10-10 Tue 07:50] =>  0:07
CLOCK: [2023-10-09 Mon 17:26]--[2023-10-09 Mon 18:19] =>  0:53
CLOCK: [2023-10-09 Mon 16:24]--[2023-10-09 Mon 16:26] =>  0:02
CLOCK: [2023-10-09 Mon 15:15]--[2023-10-09 Mon 15:25] =>  0:10
CLOCK: [2023-10-09 Mon 13:12]--[2023-10-09 Mon 14:56] =>  1:44
CLOCK: [2023-10-09 Mon 12:07]--[2023-10-09 Mon 12:30] =>  0:23
CLOCK: [2023-10-09 Mon 11:07]--[2023-10-09 Mon 11:58] =>  0:51
CLOCK: [2023-10-09 Mon 09:32]--[2023-10-09 Mon 11:05] =>  1:33
:END:

*** verkligen
**** carbonact
:LOGBOOK:
CLOCK: [2023-10-10 Tue 22:35]--[2023-10-10 Tue 22:52] =>  0:17
CLOCK: [2023-10-09 Mon 16:26]--[2023-10-09 Mon 17:19] =>  0:53
:END:

** v40
glasklar total: +32 (2 + 30)
glasklar this week: +2 (24 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-10-08 Sun 23:42]--[2023-10-09 Mon 02:39] =>  2:57
CLOCK: [2023-10-08 Sun 21:20]--[2023-10-08 Sun 21:53] =>  0:33
CLOCK: [2023-10-08 Sun 20:20]--[2023-10-08 Sun 20:47] =>  0:27
CLOCK: [2023-10-08 Sun 13:07]--[2023-10-08 Sun 18:10] =>  5:03
CLOCK: [2023-10-08 Sun 11:24]--[2023-10-08 Sun 11:42] =>  0:18
CLOCK: [2023-10-08 Sun 08:22]--[2023-10-08 Sun 10:16] =>  1:54
CLOCK: [2023-10-06 Fri 11:45]--[2023-10-06 Fri 13:04] =>  1:19
CLOCK: [2023-10-04 Wed 15:42]--[2023-10-04 Wed 15:51] =>  0:09
CLOCK: [2023-10-03 Tue 22:00]--[2023-10-04 Wed 00:27] =>  2:27
CLOCK: [2023-10-03 Tue 17:38]--[2023-10-03 Tue 19:15] =>  1:37
CLOCK: [2023-10-03 Tue 15:11]--[2023-10-03 Tue 16:30] =>  1:19
CLOCK: [2023-10-03 Tue 13:08]--[2023-10-03 Tue 13:39] =>  0:31
:END:

*** glasklar
:LOGBOOK:
CLOCK: [2023-10-06 Fri 09:27]--[2023-10-06 Fri 11:45] =>  2:18
CLOCK: [2023-10-06 Fri 06:12]--[2023-10-06 Fri 06:33] =>  0:21
CLOCK: [2023-10-05 Thu 09:55]--[2023-10-05 Thu 13:28] =>  3:33
CLOCK: [2023-10-05 Thu 06:38]--[2023-10-05 Thu 06:58] =>  0:20
CLOCK: [2023-10-04 Wed 12:30]--[2023-10-04 Wed 15:42] =>  3:12
CLOCK: [2023-10-03 Tue 14:27]--[2023-10-03 Tue 15:01] =>  0:34
CLOCK: [2023-10-03 Tue 10:04]--[2023-10-03 Tue 13:08] =>  3:04
CLOCK: [2023-10-03 Tue 07:40]--[2023-10-03 Tue 10:04] =>  2:24
CLOCK: [2023-10-02 Mon 15:10]--[2023-10-02 Mon 17:54] =>  2:44
CLOCK: [2023-10-02 Mon 13:15]--[2023-10-02 Mon 14:49] =>  1:34
CLOCK: [2023-10-02 Mon 09:36]--[2023-10-02 Mon 12:53] =>  3:17
CLOCK: [2023-10-02 Mon 08:43]--[2023-10-02 Mon 09:30] =>  0:47
:END:

*** tor
:LOGBOOK:
CLOCK: [2023-10-04 Wed 08:20]--[2023-10-04 Wed 10:16] =>  1:56
:END:

** v39
glasklar total: +30 (15 + 15)
glasklar this week: +15 (37 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-09-30 Sat 13:45]--[2023-09-30 Sat 14:40] =>  0:55
CLOCK: [2023-09-29 Fri 11:00]--[2023-09-29 Fri 12:59] =>  1:59
CLOCK: [2023-09-28 Thu 16:57]--[2023-09-28 Thu 17:09] =>  0:12
CLOCK: [2023-09-28 Thu 08:25]--[2023-09-28 Thu 09:11] =>  0:46
CLOCK: [2023-09-27 Wed 22:19]--[2023-09-27 Wed 22:56] =>  0:37
CLOCK: [2023-09-27 Wed 07:50]--[2023-09-27 Wed 10:27] =>  2:37
CLOCK: [2023-09-26 Tue 23:06]--[2023-09-27 Wed 00:01] =>  0:55
CLOCK: [2023-09-26 Tue 18:13]--[2023-09-26 Tue 19:12] =>  0:59
CLOCK: [2023-09-26 Tue 08:34]--[2023-09-26 Tue 09:15] =>  0:41
CLOCK: [2023-09-25 Mon 19:25]--[2023-09-25 Mon 20:16] =>  0:51
CLOCK: [2023-09-25 Mon 18:23]--[2023-09-25 Mon 18:34] =>  0:11
CLOCK: [2023-09-25 Mon 04:24]--[2023-09-25 Mon 06:3]5 =>  2:11
:END:
*** glasklar
:LOGBOOK:
CLOCK: [2023-10-01 Sun 17:06]--[2023-10-01 Sun 17:28] =>  0:22
CLOCK: [2023-09-30 Sat 07:55]--[2023-09-30 Sat 08:42] =>  0:47
CLOCK: [2023-09-29 Fri 21:50]--[2023-09-30 Sat 01:35] =>  3:45
CLOCK: [2023-09-29 Fri 20:57]--[2023-09-29 Fri 21:30] =>  0:58
CLOCK: [2023-09-29 Fri 17:18]--[2023-09-29 Fri 18:46] =>  1:28
CLOCK: [2023-09-29 Fri 14:53]--[2023-09-29 Fri 15:40] =>  0:47
CLOCK: [2023-09-29 Fri 12:59]--[2023-09-29 Fri 14:36] =>  1:37
CLOCK: [2023-09-29 Fri 08:51]--[2023-09-29 Fri 11:00] =>  2:09
CLOCK: [2023-09-29 Fri 08:35]--[2023-09-29 Fri 08:41] =>  0:06
CLOCK: [2023-09-28 Thu 17:09]--[2023-09-28 Thu 17:41] =>  0:32
CLOCK: [2023-09-28 Thu 09:11]--[2023-09-28 Thu 16:57] =>  7:46
CLOCK: [2023-09-27 Wed 23:01]--[2023-09-27 Wed 23:20] =>  0:19
CLOCK: [2023-09-27 Wed 22:13]--[2023-09-27 Wed 22:19] =>  0:06
CLOCK: [2023-09-27 Wed 13:31]--[2023-09-27 Wed 15:59] =>  2:28
CLOCK: [2023-09-27 Wed 10:27]--[2023-09-27 Wed 11:42] =>  1:15
CLOCK: [2023-09-26 Tue 14:15]--[2023-09-26 Tue 15:59] =>  1:44
CLOCK: [2023-09-26 Tue 13:20]--[2023-09-26 Tue 13:35] =>  0:15
CLOCK: [2023-09-26 Tue 09:42]--[2023-09-26 Tue 12:57] =>  3:15
CLOCK: [2023-09-26 Tue 09:15]--[2023-09-26 Tue 09:17] =>  0:02
CLOCK: [2023-09-25 Mon 10:00]--[2023-09-25 Mon 17:41] =>  7:41
:END:
*** verkligen
:LOGBOOK:
CLOCK: [2023-09-26 Tue 22:00]--[2023-09-26 Tue 23:06] =>  1:06
:END:

** v38
glasklar total: +15 (7 + 8)
glasklar this week: +7 (29 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-09-24 Sun 12:43]--[2023-09-24 Sun 12:58] =>  0:15
CLOCK: [2023-09-24 Sun 09:10]--[2023-09-24 Sun 09:50] =>  0:40
CLOCK: [2023-09-23 Sat 20:30]--[2023-09-23 Sat 22:07] =>  1:37
CLOCK: [2023-09-23 Sat 16:52]--[2023-09-23 Sat 18:30] =>  1:38
CLOCK: [2023-09-23 Sat 12:53]--[2023-09-23 Sat 13:40] =>  0:47
CLOCK: [2023-09-20 Wed 19:32]--[2023-09-20 Wed 19:47] =>  0:15
CLOCK: [2023-09-19 Tue 14:59]--[2023-09-19 Tue 15:44] =>  0:45
CLOCK: [2023-09-19 Tue 13:28]--[2023-09-19 Tue 13:58] =>  0:30
:END:

*** glasklar
:LOGBOOK:
CLOCK: [2023-09-24 Sun 12:58]--[2023-09-24 Sun 13:10] =>  0:12
CLOCK: [2023-09-21 Thu 10:02]--[2023-09-21 Thu 17:04] =>  7:02
CLOCK: [2023-09-21 Thu 07:43]--[2023-09-21 Thu 08:05] =>  0:22
CLOCK: [2023-09-20 Wed 19:56]--[2023-09-20 Wed 20:01] =>  0:05
CLOCK: [2023-09-20 Wed 09:30]--[2023-09-20 Wed 19:32] => 10:02
full day with rgdd and nisse in the office, including lunch
CLOCK: [2023-09-19 Tue 18:28]--[2023-09-19 Tue 19:06] =>  0:38
CLOCK: [2023-09-19 Tue 15:44]--[2023-09-19 Tue 16:27] =>  0:43
CLOCK: [2023-09-19 Tue 14:15]--[2023-09-19 Tue 14:40] =>  0:25
CLOCK: [2023-09-19 Tue 11:00]--[2023-09-19 Tue 13:28] =>  2:28
CLOCK: [2023-09-19 Tue 10:54]--[2023-09-19 Tue 10:55] =>  0:01
CLOCK: [2023-09-19 Tue 09:55]--[2023-09-19 Tue 10:40] =>  0:45
CLOCK: [2023-09-19 Tue 07:45]--[2023-09-19 Tue 09:54] =>  2:09
CLOCK: [2023-09-18 Mon 13:00]--[2023-09-18 Mon 16:30] =>  3:30
:END:

*** verkligen
:LOGBOOK:
CLOCK: [2023-09-20 Wed 19:47]--[2023-09-20 Wed 19:56] =>  0:09
:END:

** v37
glasklar total: +8 (8 + 0)
glasklar this week: +8 (30 - 22)

*** adbc
:LOGBOOK:
CLOCK: [2023-09-17 Sun 17:12]--[2023-09-17 Sun 20:22] =>  3:10
CLOCK: [2023-09-17 Sun 06:59]--[2023-09-17 Sun 10:25] =>  3:26
CLOCK: [2023-09-16 Sat 20:00]--[2023-09-16 Sat 22:10] =>  2:10
CLOCK: [2023-09-16 Sat 14:00]--[2023-09-16 Sat 14:18] =>  0:18
CLOCK: [2023-09-16 Sat 11:07]--[2023-09-16 Sat 12:33] =>  1:26
CLOCK: [2023-09-16 Sat 08:37]--[2023-09-16 Sat 09:00] =>  0:23
CLOCK: [2023-09-15 Fri 19:16]--[2023-09-15 Fri 22:17] =>  3:01
CLOCK: [2023-09-15 Fri 16:25]--[2023-09-15 Fri 17:45] =>  1:20
CLOCK: [2023-09-15 Fri 14:39]--[2023-09-15 Fri 15:30] =>  0:51
CLOCK: [2023-09-15 Fri 12:50]--[2023-09-15 Fri 13:10] =>  0:20
CLOCK: [2023-09-15 Fri 12:00]--[2023-09-15 Fri 12:30] =>  0:30
CLOCK: [2023-09-15 Fri 11:35]--[2023-09-15 Fri 11:37] =>  0:02
CLOCK: [2023-09-15 Fri 07:08]--[2023-09-15 Fri 07:22] =>  0:14
CLOCK: [2023-09-14 Thu 18:53]--[2023-09-14 Thu 20:23] =>  1:30
CLOCK: [2023-09-14 Thu 15:54]--[2023-09-14 Thu 17:53] =>  1:59
CLOCK: [2023-09-14 Thu 12:45]--[2023-09-14 Thu 12:47] =>  0:02
CLOCK: [2023-09-14 Thu 11:45]--[2023-09-14 Thu 12:13] =>  0:28
CLOCK: [2023-09-13 Wed 08:33]--[2023-09-13 Wed 08:46] =>  0:13
CLOCK: [2023-09-13 Wed 06:43]--[2023-09-13 Wed 08:05] =>  1:22
CLOCK: [2023-09-11 Mon 11:40]--[2023-09-11 Mon 13:00] =>  1:20
CLOCK: [2023-09-11 Mon 08:51]--[2023-09-11 Mon 09:00] =>  0:09
CLOCK: [2023-09-11 Mon 05:58]--[2023-09-11 Mon 07:00] =>  1:02
:END:
*** glasklar
:LOGBOOK:
CLOCK: [2023-09-16 Sat 09:42]--[2023-09-16 Sat 09:59] =>  0:17
CLOCK: [2023-09-15 Fri 13:50]--[2023-09-15 Fri 14:39] =>  0:49
CLOCK: [2023-09-15 Fri 11:49]--[2023-09-15 Fri 12:00] =>  0:11
CLOCK: [2023-09-15 Fri 11:01]--[2023-09-15 Fri 11:29] =>  0:28
CLOCK: [2023-09-15 Fri 08:08]--[2023-09-15 Fri 08:38] =>  0:30
CLOCK: [2023-09-14 Thu 14:00]--[2023-09-14 Thu 14:45] =>  0:45
CLOCK: [2023-09-14 Thu 12:42]--[2023-09-14 Thu 12:45] =>  0:03
CLOCK: [2023-09-14 Thu 12:30]--[2023-09-14 Thu 12:42] =>  0:12
CLOCK: [2023-09-14 Thu 10:51]--[2023-09-14 Thu 11:41] =>  0:50
CLOCK: [2023-09-14 Thu 09:25]--[2023-09-14 Thu 10:41] =>  1:16
CLOCK: [2023-09-14 Thu 08:30]--[2023-09-14 Thu 08:45] =>  0:15
CLOCK: [2023-09-13 Wed 13:54]--[2023-09-13 Wed 18:45] =>  4:51
CLOCK: [2023-09-13 Wed 08:46]--[2023-09-13 Wed 13:09] =>  4:23
CLOCK: [2023-09-12 Tue 19:38]--[2023-09-12 Tue 20:08] =>  0:30
CLOCK: [2023-09-12 Tue 16:07]--[2023-09-12 Tue 17:58] =>  1:51
CLOCK: [2023-09-12 Tue 13:53]--[2023-09-12 Tue 15:19] =>  1:26
CLOCK: [2023-09-12 Tue 12:27]--[2023-09-12 Tue 13:05] =>  0:38
CLOCK: [2023-09-12 Tue 09:46]--[2023-09-12 Tue 12:00] =>  2:14
CLOCK: [2023-09-12 Tue 09:15]--[2023-09-12 Tue 09:45] =>  0:30
CLOCK: [2023-09-11 Mon 16:29]--[2023-09-11 Mon 18:20] =>  1:51
CLOCK: [2023-09-11 Mon 15:38]--[2023-09-11 Mon 16:29] =>  0:51
CLOCK: [2023-09-11 Mon 14:00]--[2023-09-11 Mon 15:28] =>  1:28
CLOCK: [2023-09-11 Mon 13:00]--[2023-09-11 Mon 13:25] =>  0:25
CLOCK: [2023-09-11 Mon 09:00]--[2023-09-11 Mon 11:40] =>  2:40
CLOCK: [2023-09-11 Mon 08:41]--[2023-09-11 Mon 08:51] =>  0:10
:END:
*** tor
:LOGBOOK:
CLOCK: [2023-09-15 Fri 11:37]--[2023-09-15 Fri 11:49] =>  0:12
CLOCK: [2023-09-14 Thu 12:13]--[2023-09-14 Thu 12:30] =>  0:17
:END:

*** verkligen
:LOGBOOK:
CLOCK: [2023-09-16 Sat 09:00]--[2023-09-16 Sat 09:42] =>  0:42
:END:

** v36
glasklar: +-0

*** glasklar
:LOGBOOK:
CLOCK: [2023-09-08 Fri 12:00]--[2023-09-08 Fri 13:13] =>  1:13
CLOCK: [2023-09-07 Thu 13:50]--[2023-09-07 Thu 17:58] =>  4:08
CLOCK: [2023-09-07 Thu 08:59]--[2023-09-07 Thu 12:50] =>  3:51
CLOCK: [2023-09-06 Wed 12:50]--[2023-09-06 Wed 16:30] =>  3:40
CLOCK: [2023-09-06 Wed 09:04]--[2023-09-06 Wed 11:30] =>  2:26
CLOCK: [2023-09-06 Wed 08:56]--[2023-09-06 Wed 08:57] =>  0:01
CLOCK: [2023-09-06 Wed 06:20]--[2023-09-06 Wed 06:35] =>  0:15
CLOCK: [2023-09-05 Tue 16:18]--[2023-09-05 Tue 16:48] =>  0:30
CLOCK: [2023-09-05 Tue 15:00]--[2023-09-05 Tue 15:15] =>  0:15
CLOCK: [2023-09-05 Tue 14:15]--[2023-09-05 Tue 14:50] =>  0:35
CLOCK: [2023-09-05 Tue 11:50]--[2023-09-05 Tue 13:21] =>  1:31
sigsum
CLOCK: [2023-09-04 Mon 15:35]--[2023-09-04 Mon 15:55] =>  0:20
CLOCK: [2023-09-04 Mon 13:13]--[2023-09-04 Mon 14:00] =>  0:47
CLOCK: [2023-09-04 Mon 09:45]--[2023-09-04 Mon 11:39] =>  1:54
CLOCK: [2023-09-04 Mon 09:40]--[2023-09-04 Mon 09:45] =>  0:05
CLOCK: [2023-09-04 Mon 09:00]--[2023-09-04 Mon 09:29] =>  0:29
:END:
*** vdab
:LOGBOOK:
CLOCK: [2023-09-08 Fri 16:15]--[2023-09-08 Fri 16:30] =>  0:15
CLOCK: [2023-09-08 Fri 07:46]--[2023-09-08 Fri 08:46] =>  1:00
CLOCK: [2023-09-07 Thu 19:00]--[2023-09-07 Thu 19:30] =>  0:30
CLOCK: [2023-09-05 Tue 11:24]--[2023-09-05 Tue 11:43] =>  0:19
CLOCK: [2023-09-04 Mon 20:09]--[2023-09-04 Mon 20:20] =>  0:11
CLOCK: [2023-09-04 Mon 09:29]--[2023-09-04 Mon 09:40] =>  0:11
försäkring
:END:
*** adbc
:LOGBOOK:
CLOCK: [2023-09-08 Fri 13:39]--[2023-09-08 Fri 15:01] =>  1:22
CLOCK: [2023-09-08 Fri 10:50]--[2023-09-08 Fri 12:15] =>  1:25
CLOCK: [2023-09-08 Fri 08:50]--[2023-09-08 Fri 09:50] =>  1:00
CLOCK: [2023-09-07 Thu 08:20]--[2023-09-07 Thu 08:59] =>  0:39
CLOCK: [2023-09-07 Thu 07:44]--[2023-09-07 Thu 08:06] =>  0:22
CLOCK: [2023-09-06 Wed 20:15]--[2023-09-06 Wed 20:42] =>  0:27
CLOCK: [2023-09-06 Wed 18:35]--[2023-09-06 Wed 19:30] =>  0:55
CLOCK: [2023-09-06 Wed 08:57]--[2023-09-06 Wed 09:04] =>  0:07
CLOCK: [2023-09-06 Wed 07:30]--[2023-09-06 Wed 07:39] =>  0:09
CLOCK: [2023-09-05 Tue 18:10]--[2023-09-05 Tue 19:13] =>  1:03
sieve not complaining; started on rspamd
CLOCK: [2023-09-05 Tue 17:31]--[2023-09-05 Tue 17:41] =>  0:10
CLOCK: [2023-09-05 Tue 16:49]--[2023-09-05 Tue 17:08] =>  0:19
dovecot incoming working
CLOCK: [2023-09-05 Tue 13:54]--[2023-09-05 Tue 14:06] =>  0:12
CLOCK: [2023-09-05 Tue 07:40]--[2023-09-05 Tue 11:23] =>  3:43
dovecot config, userdb lookups finally working
CLOCK: [2023-09-04 Mon 16:10]--[2023-09-04 Mon 17:56] =>  1:46
so much dovecot and selinux i can't even
CLOCK: [2023-09-04 Mon 11:41]--[2023-09-04 Mon 12:58] =>  1:17
CLOCK: [2023-09-04 Mon 08:40]--[2023-09-04 Mon 09:00] =>  0:20
:END:
